#### Pi Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Multiples of Ï€.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Pi { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Pi As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Pi { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace